In [1]:
import numpy as  np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
data = pd.DataFrame({'food':['bacon', 'pulled pork', 'bacon', 'pastrami', 'corned beaf', 'bacon', 'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [3]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beaf     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [4]:
meat_to_animal = {'bacon':'pig', 'pulled pork':'pig', 'pastrami':'cow', 'corned beaf':'cow', 'honey ham':'pig', 'nova lox':'salmon'}

In [5]:
lowercased = data['food'].str.lower()

In [6]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beaf
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [7]:
data['animal'] = lowercased.map(meat_to_animal)

In [8]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beaf     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [9]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [10]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [11]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [12]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [13]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [14]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [16]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['ohio', 'colorado', 'new york'],
                    columns=['one', 'two', 'three', 'four'])

In [17]:
transform = lambda x: x[:4].upper()

In [18]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [19]:
data.index = data.index.map(transform)

In [20]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [22]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [23]:
data.rename(index={'OHIO':'INDIANA'}, columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [24]:
data.rename(index={'OHIO':'INDIANA'}, inplace=True)

In [25]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [26]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [28]:
bins = [18, 25, 35, 60, 100]

In [30]:
cats = pd.cut(ages, bins)

In [31]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [32]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [33]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [34]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [35]:
pd.cut(ages, [18, 26, 36, 62, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [36, 62), [36, 62), [36, 62), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 62) < [62, 100)]

In [36]:
data = np.random.rand(20)

In [37]:
pd.cut(data, 4, precision=2)

[(0.1, 0.32], (0.54, 0.76], (0.32, 0.54], (0.54, 0.76], (0.32, 0.54], ..., (0.1, 0.32], (0.76, 0.97], (0.54, 0.76], (0.1, 0.32], (0.1, 0.32]]
Length: 20
Categories (4, interval[float64]): [(0.1, 0.32] < (0.32, 0.54] < (0.54, 0.76] < (0.76, 0.97]]

In [2]:
data = np.random.randn(1000)

In [3]:
cats = pd.qcut(data, 4)

In [4]:
cats

[(0.678, 3.058], (0.678, 3.058], (-0.719, -0.0192], (-3.2929999999999997, -0.719], (-0.0192, 0.678], ..., (0.678, 3.058], (-3.2929999999999997, -0.719], (0.678, 3.058], (-3.2929999999999997, -0.719], (-0.719, -0.0192]]
Length: 1000
Categories (4, interval[float64]): [(-3.2929999999999997, -0.719] < (-0.719, -0.0192] < (-0.0192, 0.678] < (0.678, 3.058]]

In [5]:
pd.value_counts(cats)

(-3.2929999999999997, -0.719]    250
(-0.719, -0.0192]                250
(-0.0192, 0.678]                 250
(0.678, 3.058]                   250
dtype: int64

In [6]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1])

[(-0.0192, 1.261], (-0.0192, 1.261], (-1.329, -0.0192], (-3.2929999999999997, -1.329], (-0.0192, 1.261], ..., (-0.0192, 1.261], (-1.329, -0.0192], (-0.0192, 1.261], (-3.2929999999999997, -1.329], (-1.329, -0.0192]]
Length: 1000
Categories (4, interval[float64]): [(-3.2929999999999997, -1.329] < (-1.329, -0.0192] < (-0.0192, 1.261] < (1.261, 3.058]]

In [7]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [8]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.070503    -0.055218    -0.010414     0.005447
std       0.977568     1.022207     0.959092     0.987547
min      -3.217360    -3.485461    -2.949091    -3.283122
25%      -0.723201    -0.707484    -0.650237    -0.629104
50%      -0.096106    -0.043291    -0.031636     0.021106
75%       0.564857     0.612548     0.634297     0.675375
max       3.705603     2.954617     4.079425     3.927003

In [9]:
col = data[2]

In [10]:
col[np.abs(col) > 3]

436    4.079425
Name: 2, dtype: float64

In [12]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
75  -0.392911 -0.581836  0.109092  3.927003
134  3.705603 -0.695641 -0.557755 -0.079344
181 -0.919265 -3.485461  0.891957 -0.354965
360 -3.217360 -1.377645  1.504630  0.373736
436 -0.018445  0.916629  4.079425  1.148583
523  0.386769  0.027738 -0.287214 -3.283122
727  3.349568 -0.705822 -1.198221 -1.261697
741 -1.436528 -3.030520  1.015135 -1.910298
879 -0.303012 -3.319050 -0.972121 -2.072883

In [13]:
data[np.abs(data) > 3] = np.sign(data) *3

In [14]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.071341    -0.054383    -0.011494     0.004803
std       0.973247     1.019630     0.955084     0.983386
min      -3.000000    -3.000000    -2.949091    -3.000000
25%      -0.723201    -0.707484    -0.650237    -0.629104
50%      -0.096106    -0.043291    -0.031636     0.021106
75%       0.564857     0.612548     0.634297     0.675375
max       3.000000     2.954617     3.000000     3.000000

In [15]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0 -1.0 -1.0
1 -1.0 -1.0  1.0  1.0
2 -1.0  1.0  1.0  1.0
3 -1.0 -1.0 -1.0  1.0
4  1.0  1.0 -1.0 -1.0

In [16]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [17]:
sampler = np.random.permutation(5)

In [18]:
sampler

array([3, 4, 0, 1, 2])

In [19]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [20]:
df.take(sampler)

    0   1   2   3
3  12  13  14  15
4  16  17  18  19
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11

In [21]:
df.sample(n=3)

    0   1   2   3
0   0   1   2   3
4  16  17  18  19
3  12  13  14  15

In [22]:
choices = pd.Series([5, 7, -1, 6, 4])

In [24]:
draws = choices.sample(n=10, replace=True)

In [25]:
draws

1    7
2   -1
1    7
2   -1
1    7
2   -1
2   -1
3    6
4    4
2   -1
dtype: int64

In [26]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1':range(6)})

In [27]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [29]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [30]:
df_with_dummy = df[['data1']].join(dummies)

In [31]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [32]:
val = 'a, b,  guido'

In [34]:
val.split(',')

['a', ' b', '  guido']

In [35]:
pieces = [x.strip() for x in val.split(',')]

In [36]:
pieces

['a', 'b', 'guido']

In [37]:
first, second, third = pieces

In [38]:
first + '::' +  second + '::' + third

'a::b::guido'

In [39]:
'::'.join(pieces)

'a::b::guido'

In [40]:
'guido' in val

True

In [41]:
val.index(',')

1

In [42]:
val.find(':')

-1

In [43]:
val.count(',')

2

In [44]:
val.replace(',', '::')

'a:: b::  guido'

In [45]:
val.replace(',', '')

'a b  guido'

In [46]:
import re

In [47]:
text = "foo   bar\t baz   \tqux"

In [48]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [49]:
regex = re.compile('\s+')

In [50]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [51]:
regex.findall(text)

['   ', '\t ', '   \t']